Revit 2026 API
GeometryCreationUtilities Methods
The GeometryCreationUtilities type exposes the following members.
Methods
Name | Description
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>)
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>, SolidOptions)
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double)
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double, SolidOptions)
CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, XYZ)
CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, XYZ, SolidOptions)
CreateLoftGeometry
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double)
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double, SolidOptions)
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>)
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>, SolidOptions)
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>)
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, SolidOptions)
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace